src/ExchangePlans/МобильноеПриложениеТорговыйПредставитель/МобильноеПриложениеТорговыйПредставитель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="3e10e35c-66e8-4248-b165-a805ced2626c">
  <name>МобильноеПриложениеТорговыйПредставитель</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйКомпьютер</name>
    <type>
      <types>CatalogRef.МобильныеКомпьютеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМобильногоПриложения</name>
    <type>
      <types>CatalogRef.ВерсииМобильныхПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтбораСхемыОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиСоздаватьЗаказыПоЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ИспользованиеКонтактнойИнформацииМобильнымПриложением</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/ExchangePlans/МобильноеПриложениеТорговыйПредставитель/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УзелУжеСуществует = МобильныеПриложения.УзелДляПодключенияСуществует(Пользователь, МобильныйКомпьютер, Ссылка);	
	
	Если УзелУжеСуществует Тогда
		ТекстСообщения = НСтр("ru='Настройка для торгового представителя %Пользователь% и мобильного компьютера %МобильныйКомпьютер% уже существует';uk='Настройка для торгового представника %Пользователь% та мобільного комп''ютера %МобильныйКомпьютер% вже існує'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Пользователь%", Пользователь);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%МобильныйКомпьютер%", МобильныйКомпьютер);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	Пользователь = Неопределено;
	МобильныйКомпьютер = Неопределено;
	ИмяПользователя = "";
	Пароль = "";
	ХранилищеОтбораСхемыОбмена = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Для этого узла не требуется проверка заполнения ряда реквизитов
	Если Ссылка = ПланыОбмена.МобильноеПриложениеТорговыйПредставитель.ЭтотУзел() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Пользователь");
		МассивНепроверяемыхРеквизитов.Добавить("МобильныйКомпьютер");
		МассивНепроверяемыхРеквизитов.Добавить("ВерсияМобильногоПриложения");
		МассивНепроверяемыхРеквизитов.Добавить("ИспользованиеКонтактнойИнформации");
		МассивНепроверяемыхРеквизитов.Добавить("ИмяПользователя");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

#КонецОбласти
КонецПроцедуры
#КонецЕсли
